# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. 
# Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

print ('введите количество журавликов')
summa = int (input())

Petya = summa * 25 // 100
Serg =  summa * 25 // 100
Katya = summa * 50 // 100

print ("Петя", Petya, "Катя", Katya, "Серега", Serg)